Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: The last expression, for example, denotes the function that takes three types, α, β, and γ, and two functions, g : β → γ and f : α → β, and returns the composition of g and f.
ko: 마지막 표현식은 세 유형 α, β, γ과 두 함수 g : β → γ과 f : α → β을 받고 g과 f의 합성을 반환하는 함수를 나타냅니다.

source: The last two theorems show that the definitions preserve the value.
ko: 마지막 두 정리는 정의가 값을 보존함을 보이는 것입니다.

source: The last, Prod.rec, provides another mechanism for defining functions on a product in terms of a function on the two components.
ko: 마지막으로 Prod.rec은 두 원소에 대한 함수에 대한 관점으로 곱에 대한 함수를 정의하는 또다른 방법을 제공합니다.

source: The letter "f" is for "French," since the unicode symbols can also be used as French quotation marks.
ko: "f"는 "프랑스"의 첫머리 글자입니다. 왜냐하면 이 유니코드 기호는 프랑스 인용부호로도 사용되기 때문입니다.

source: The list is indefinite, so that there is a Type n for every natural number n.
ko: 모든 자연수 n에 대해 Type n가 있어서 이런 리스트를 무한히 나열할 수 있습니다.

source: The list of subtrees is represented by the type TreeList α, which is defined to be either the empty list, nil, or the cons of a tree and an element of TreeList α.
ko: 하위 트리의 리스트는 TreeList α형으로 표현됩니다. 이것은 빈 리스트 nil이거나 트리의 cons과 TreeList α의 원소로 정의될 수 있습니다.

source: The macro h ▸ e uses more effective heuristics for computing this implicit parameter, and often succeeds in situations where applying Eq.subst fails.
ko: 매크로 h ▸ e은 이 암시적 인자를 계산하는데 더욱 효과적인 경험론을 사용합니다. 그리고 종종 Eq.subst의 적용이 실패하는 상황에서 성공적입니다.

source: The main function of Lean is to translate user input to formal expressions that are checked by the kernel for correctness and then stored in the environment for later use.
ko: 린의 주요 기능은 사용자의 입력을 커널에 의해 올바름이 검증된 형식 표현식으로 번역하는 것과 나중에 사용할 수 있도록 환경에 저장해두는 것 입니다.

source: The main idea behind type classes is to make arguments such as Add a implicit, and to use a database of user-defined instances to synthesize the desired instances automatically through a process known as typeclass resolution.
ko: 유형 클래스 뒤편의 주요 아이디어는 Add a 같은 인수를 암시적으로 만드는 것이고 사용자 정의 개체들의 데이터베이스를 사용해 유형 클래스 해결책으로 알려진 과정을 통해 원하는 개체를 자동적으로 합성하는 것입니다.

source: The mnemonic in the notation above is that you are generalizing the goal by setting 3 to an arbitrary variable x.
ko: 위의 표기에 대한 기억법은 여러분이 3으로 설정한 목표을 임의의 변수 x로 일반화시키는 것입니다.

source: The most basic form of the tactic is rewrite [t], where t is a term whose type asserts an equality.
ko: 전략의 가장 기본적인 형태는 rewrite [t]입니다. 여기서 t는 동등석을 주장하는 유형의 항입니다.

source: The most basic syntax extension commands allow introducing new (or overloading existing) prefix, infix, and postfix operators.
ko: 가장 기본적인 문법 확장 명령은 새로운 (혹은 이미 있는 것을 오버로딩하는 것) 전위, 중위 그리고 후위 연산자를 도입하는 것을 허용합니다.

source: The motivation is to ensure your tactic proofs do not rely on automatically generated names, and are consequently more robust.
ko: 그 이유는 여러분의 전략 증명이 자동으로 생성된 이름에 의존하지 않도록 보장하기 위함입니다. 그리고 그 결과로 증명은 더 튼튼하게 됩니다.

source: The naive first attempt is to enter tactic mode and try rw [Nat.mul_comm].
ko: 첫 순진한 시도는 전략 모드로 들어가 rw [Nat.mul_comm]을 시도하는 것입니다.

source: The naive first attempt is to enter tactic mode and try rw [zero_add].
ko: 첫 순진한 시도는 전략 모드로 들어가 rw [zero_add]를 시도하는 것입니다.

source: The name double is defined as a function that takes an input parameter x of type Nat, where the result of the call is x + x, so it is returning type Nat.
ko: 이름 double은 Nat 유형의 입력 매개변수 x를 받고 호출의 결과로 x + x인 함수로 정의되었습니다. 그래서 Nat 유형을 반환합니다.

source: The native version is much faster than the web version, and is more flexible in other ways, too.
ko: 원본 버전은 웹 버전보다 더 빠르고 다른 방식보다 유연합니다.

source: The new notation is preferred to the binary notation since the latter, before chaining, would stop parsing after 1 + 2.
ko: 새로운 기호는 이항기호로 정의되길 선호합니다. 왜냐면 뒤에 나올 것은 연결되기 전에 1 + 2 뒤에 분석을 멈춥니다.

source: The new subgoals can be solved in any order.
ko: 새로운 하위 목표는 임의의 순서로 풀릴 수 있습니다.

source: The next section offers syntax that allow you to write calculational proofs in a more natural and perspicuous way.
ko: 다음 섹션은 여러분이 계산 증명을 더 자연스럽고 안목이 있는 방향으로 작성하게 하는 문법을 제공합니다.

source: The next example simplifies all the hypotheses, and then uses them to prove the goal.
ko: 다음 예제는 모든 가정을 단순화하고 그 후 이들로 목표를 증명하는데 사용합니다.

source: The next example simply permutes the last two lines in the previous proof.
ko: 다음 예제는 이전 증명에서 마지막 두 줄을 단순히 바꾼 것입니다.

source: The next example uses both these rules to produce a proof of (p → q) → ¬q → ¬p.
ko: 다음 예제는 (p → q) → ¬q → ¬p의 증명을 만들기 위해 세 가지 규칙 모두를 사용합니다.

source: The next two arguments specify how to compute the zero and successor cases, as described above.
ko: 다음 두 인수는 위에서 설명한 0과 계승자에 대한 경우를 어떻게 계산하는지를 보여줍니다.

source: The next two examples instead apply associativity to move the parenthesis to the right on both sides, and then switch b and c.
ko: 다음 두 예제는 결합성을 적용하는 대신 괄호를 오른쪽으로 옮깁니다. 그리고 b와 c를 교환합니다.

source: The notation rw [t] at h applies the rewrite t at hypothesis h.
ko: rw [t] at h 표기는 가정 h에 t에 다시쓰기를 적용합니다.

source: The notation @[simp] declares reverse_mk_symm to have the [simp] attribute, and can be spelled out more explicitly:
ko: @[simp]표기는 reverse_mk_symm가 [simp] 특성을 갖고 더 명시적으로 쓸 수 있도록 선언합니다.

source: The notation {x : α // p x} is syntactic sugar for Subtype (fun x : α => p x).
ko: 기호 {x : α // p x}은 Subtype (fun x : α => p x)에 대한 문법적 설탕입니다.

source: The notation . is whitespace sensitive and relies on the indentation to detect whether the tactic block ends.
ko: . 표기는 화이트 스페이스(space key)에 민감하고 전략 블럭의 끝인지 감지하기 위해 인덴트(4개의 빈칸, tab key)에 의존합니다.

source: The notation ←t can be used to instruct the tactic to use the equality t in the reverse direction.
ko: ←t 기호는 역방향으로 등식 t을 사용하도록 전략에게 지시하는데 사용될 수 있습니다.

source: The one thing you are missing is a mechanism for defining new data types.
ko: 한 가지 여러분이 놓친 작동원리는 새로운 데이터 형을 정의하는 것에 대한 것입니다.

source: The order of operations is as follows: unary negation ¬ binds most strongly, then ∧, then ∨, then →, and finally ↔.
ko: 연산자의 우선순위는 다음과 같습니다. 일항 부정 ¬ 은 가장 강하게 결합하고 그 다음은 ∧ 그 다음 ∨ 그 다음 → 그리고 마지막으로 ↔입니다.

source: The other propositional connectives are defined in Lean's library in the file Prelude.core (see importing files for more information on the library hierarchy), and each connective comes with its canonical introduction and elimination rules.
ko: 다른 명제논리적 연결사들은 린의 라이브러리의 Prelude.core 파일 속에 정의되 있습니다. (라이브러리 계층에 대한 더 많은 정보를 위해 파일 불러오기를 보세요.) 그리고 각 연결사들마다 그것의 정식 도입, 제거 규칙이 딸려 나옵니다.

source: The output of the #check command means that whenever α has type Type n, List α also has type Type n.
ko: #check 명령의 출력은 α가 Type n유형을 갖는 한 List α도 Type n 유형을 가짐을 의미합니다.

source: The output of the first #check command is r ?m.1 ?m.2 → r ?m.2 ?m.3 → r ?m.1 ?m.3, indicating that the implicit arguments are unspecified in this case.
ko: 처음 #check 명령의 출력은 r ?m.1 ?m.2 → r ?m.2 ?m.3 → r ?m.1 ?m.3입니다. 이들은 여기에서 명시되지 않은 암시적 인자들을 지칭합니다.

source: The parameter list can be separated like this:
ko: 매개변수 리스트는 이와 같이 나눠 쓸 수 있습니다.

source: The parameters α and β are considered input parameters and γ an output one.
ko: 매개변수 α와 β는 입력 매개변수로 γ는 출력 매개변수 입니다.

source: The parentheses around h hq are not necessary, but we have added them for clarity.
ko: h hq 주위의 괄호는 필요하지 않습니다만 우리는 명황성을 이해 이들을 추가했습니다.

source: The polymorphic method toString has type {α : Type u} → [ToString α] → α → String.
ko: 다형적인 방법 toString은 {α : Type u} → [ToString α] → α → String형 입니다.

source: The precedence is a natural number describing how "tightly" an operator binds to its arguments, encoding the order of operations.
ko: 연산의 순서를 부호화하는 우선순위는 연산자가 그것의 인자와 얼마나 "강력하게" 묶여있는지를 설명하는 자연수입니다.

source: The presence of implicit arguments means that at times there may be insufficient information to fix the meaning of an expression precisely.
ko: 암시적 인수의 존재는 현재로는 식의 정확한 의미를 고치기에 정보가 불충분함을 의미할 수 있습니다.

source: The previous examples can therefore be written concisely as follows:
ko: 그러므로 이전 예제는 다음과 같이 간결하게 쓸 수 있습니다.

source: The previous example can be written as follows:
ko: 다음 예제는 다음과 같이 쓰일 수 있습니다.

source: The problem goes away if we use weak implicit arguments:
ko: 문제는 우리가 약한 암시적인 인수를 사용하면 사라집니다.

source: The process of instantiating these "holes," or "placeholders," in a term is often known as elaboration.
ko: 이런 "구멍" 또는 "플레이스 홀더"의 인스턴스화 과정은 협력(elaboration)으로 불리기도 합니다.

source: The product type has one constructor, Prod.mk, which takes two arguments.
ko: 곱 유형은 하나의 생성자 Prod.mk를 갖고 있습니다. 이것은 두 인수를 받습니다.

source: The product type is a structure, as is the dependent product (Sigma) type.
ko: 곱 형은 의존적 곱 (시그마) 형과 마찬가지로 구조체입니다.

source: The projection Inhabited.default will allow us to "extract" such an element of a from an element of Inhabited a.
ko: 투영 Inhabited.default은 Inhabited a의 원소로부터 a의 원소 같은 것을 "추출"하도록 해줄 것입니다.

source: The proof above is functionally equivalent to the following:
ko: 위의 증명은 다음과 기능적으로 동등합니다.

source: The proof of zero_add makes it clear that proof by induction is really a form of recursion in Lean.
ko: zero_add의 증명은 귀납적 증명은 실제로 린에서 재귀의 한 형태라는 점을 명확히 합니다.

source: The propositional connectives come with the following notation:
ko: 명제 연결사는 다음 기호로 따라온다.

source: The recursor Eq.rec is also used to define substitution:
ko: 재귀자 Eq.rec도 대입을 정의하는데 사용됩니다.

source: The requirement is that if the latter is present at all, it occurs only strictly positively.
ko: 요구사항은 만약 후자가 전부 나타났다면 이것은 엄격하게 긍정적으로만 일어납니다.

source: The results are broken down into small steps: th1 shows that a relation that is reflexive and euclidean is symmetric, and th2 shows that a relation that is symmetric and euclidean is transitive.
ko: 결과는 작은 단계들로 나눠집니다. th1은 반사적이고 유클리디안은 대칭적이다는 관계를 증명하고 th2은 대칭적이고 유클리디언은 추이적이다는 관계를 증명합니다.

source: The results of these definitions are essentially the same as the ones given earlier in this section.
ko: 이 정의의 결과는 본질적으로 이전 섹션에서 제시된 것과 같습니다.

source: The right hand side bar can be any expression, not just a lambda.
ko: 우변 bar는 lambda뿐만 아니라 어떤 식이든 될 수 있습니다.

source: The rule Eq.subst is used to define the following auxiliary rules, which carry out more explicit substitutions.
ko: Eq.subst의 규칙은 더 명백한 대체를 수행하는 다음의 부가적인 규칙을 정의하는데 사용됩니다.

source: The second argument is often a variable as in the example above, or a raw natural number.
ko: 두 번째 인수는 종종 위의 예제의 것처럼 변수이거나 생(raw) 자연수입니다.

source: The second is the scalar multiplication for arrays.
ko: 두 번째 것은 배열에 대한 스칼라 곱셈입니다.

source: The second main reason to use conversion mode is to rewrite under binders.
ko: 전환 모드를 사용하는 두 번째 주요 이유는 결합자 아래에서 다시쓰기 위한 것입니다.

source: The second way to use Lean is to install and run it natively on your computer.
ko: Lean을 사용하는 두 번째 방법은 여러분의 컴퓨터에 설치하여 로컬로 실행하는 것 입니다.

source: The short explanation is that types can depend on parameters.
ko: 간단한 설명은 유형이 매개변수에 의존할 수 있다는 겁니다.

source: The similarity between ∃ and Σ is another instance of the Curry-Howard isomorphism.
ko: ∃과Σ의 유사점은 이들이 커리-하워드 동형의 또 다른 개체라는 점입니다.

source: The similarity between ∧ and × is another instance of the Curry-Howard isomorphism, but in contrast to implication and the function space constructor, ∧ and × are treated separately in Lean.
ko: ∧과 ×의 유사성은 커리-하워드 동형론의 또다른 예입니다. 그러나 함의와 함수 공간 생성자와는 대조적으로 ∧과 ×은 린에서 별개로 다뤄집니다.

source: The simplest kind of inductive type is simply a type with a finite, enumerated list of elements.
ko: 가장 간단한 귀납형은 원소의 리스트를 유한하게 열거한 유형입니다.

source: The simplifier will loop if you apply it blindly, but rewrite will do the trick.
ko: 단순화기는 여러분이 맹목적으로 적용한다면 무한루프를 돌 것입니다. 그러나 rewrite는 트릭을 씁니다.

source: The simplifier then proves isPrefix [1, 2, 3] [1, 2, 3] by rewriting it to True.
ko: 그럼 단순화기는 isPrefix [1, 2, 3] [1, 2, 3]을 그것이 True라고 다시쓰기하여 증명합니다.

source: The simplifier will also do propositional rewriting.
ko: 단순화기도 명제 다시쓰기를 할 것 입니다.

source: The solution is:
ko: 해결책은

source: The source code, and instructions for building Lean, are available at https://github.com/leanprover/lean4/.
ko: Lean을 만든 소스코드와 명령어들은 https://github.com/leanprover/lean4/에서 볼 수 있습니다.

source: The standard library also contains a variant of ite called dite, the dependent if-then-else expression.
ko: 표준 라이브러리는 또 dite (the dependent if-then-else expression)라는 ite의 변종을 갖습니다.

source: The standard library defines a type class Inhabited to enable type class inference to infer a "default" element of an inhabited type.
ko: 표준 라이브러리는 유형 클래스 추론이 내재된 유형의 "기본" 원소를 유추할 수 있도록 유형 클래스 Inhabited를 정의합니다.

source: The standard library introduces the tactic decide that uses the Decidable instance to solve simple goals.
ko: 표준 라이브러리는 단순한 목표를 풀기 위해 Decidable 개체를 사용하는 decide 전략을 도입합니다.

source: The statement that r is well founded, denoted WellFounded r, is exactly the statement that every element of the type is accessible.
ko: WellFounded r로 표시되어 잘 세워진 명제 r는 바로 그 유형의 모든 원소가 접근 가능한 명제입니다.

source: The structure command also generates useful recursors and theorems.
ko: 또 구조체 명령은 유용한 재귀자와 정리들을 생성합니다.

source: The structure command is essentially a "front end" for defining inductive data types.
ko: 구조체 명령은 본질적은 유도 데이터형을 정의하기 위한 "최전선"입니다.

source: The style of writing proofs is most effective when it is used in conjunction with the simp and rewrite tactics, which are discussed in greater detail in the next chapter.
ko: 증명 작성 스타일은 simp와 rewrite 전략을 결합해 사용되었을 때 가장 효과적입니다. 이것들은 다음 장에서 상세히 논할 것입니다.

source: The suffix : structure-type can be omitted whenever the name of the structure can be inferred from the expected type.
ko: 접미사 : structure-type은 언제든지 구조체의 이름이 기대되는 유형으로부터 추론될 수 있는 한 생략될 수 있습니다.

source: The syntax for doing so is as follows:
ko: 그렇게 하는 문법은 다음과 같습니다.

source: The syntax is similar to that for mutual inductive types, as described in :numref:mutual_and_nested_inductive_types.
ko: numref상호적이고 재귀적인 귀납형에서 기술한 바처럼 문법은 상호 귀납적인 유형에 대한 것과 비슷합니다.

source: The syntax is similar to that of cases, except that the argument can only be a term in the local context.
ko: 인수가 지역 상황에 대한 것이라는 점을 제외하고 문법은 cases의 것과 비슷합니다.

source: The syntax of the with is convenient for writing structured proofs.
ko: with의 문법은 구조화된 증명을 작성하는데 편리합니다.

source: The tactic decide puts it all together: to prove a target p.
ko: decide 전략은 목표 p를 증명하기 위해 모든 것을 한데 모읍니다.

source: The tactic automatically closes any goal of the form t = t.
ko: 전략은 자동적으로 t = t꼴의 임의의 목표를 자동적으로 마무리짓습니다.

source: The tactic interpreter -- tries all possible macro extensions for `triv` until one succeeds macro_rules
ko: The tactic interpreter -- `triv`에 대한 가능한 모든 매크로 확장을 어떤 것이 macro_rules을 성공할 때까지 시도합니다.

source: The tactic tries to solve the left disjunct immediately by assumption; if that fails, it tries to focus on the right disjunct; and if that doesn't work, it invokes the assumption tactic.
ko: 전략은 왼쪽의 분리자를 가정으로부터 즉시 풀려고 합니다. 만약 실패하면 이것은 오른쪽 분리자에 초점을 맞춰 시도합니다. 그리고 이게 성공하지 못하면, 가정 전략을 불러옵니다.

source: The term "predicative" stems from foundational developments around the turn of the twentieth century, when logicians such as Poincaré and Russell blamed set-theoretic paradoxes on the "vicious circles" that arise when we define a property by quantifying over a collection that includes the very property being defined.
ko: "술어"라는 말은 20세기로 접어드는 시기에 기초수학의 발전으로부터 유래되었습니다. 이때 푸엥카레와 레셀 같은 논리학자들은 정의되는 바로 그 정의되는 성질을 포함하는 모임에 대해 한정함으로써 성질을 정의할 때 발생하는 집합론적 역설 "악순환(vicious circles)"을 비난했습니다.

source: The term rewriter and simplifier are described briefly in the next section, and then in greater detail in the next chapter.
ko: 항 다시쓰기와 단순화는 다음 섹션에서 간단히 설명합니다. 그러고 나서 다음 장에서 아주 상세하게 다룹니다.

source: The theorem Nat.lt_or_ge m n says m < n ∨ m ≥ n, and it is natural to think of the proof above as splitting on these two cases.
ko: 정리 Nat.lt_or_ge m n은 m < n ∨ m ≥ n을 말합니다. 그리고 이것은 이들 두 경우를 나눔으로써 위의 증명이 당연하다고 생각합니다.

source: The triangle in the second presentation is a macro built on top of Eq.subst and Eq.symm, and you can enter it by typing \t.
ko: 두번째 보기에서 삼각형은 Eq.subst과 Eq.symm 위에 세워진 매크로입니다. 여러분은 이것은 \t을 쳐서 쓸 수 있습니다.

source: The two defining equations for addition now hold definitionally:
ko: 덧셈에 대해 정의한 두 방정식은 이제 정의상으로 성립합니다.

source: The two ways we have suggested thinking about the propositions-as-types paradigm differ in a fundamental way.
ko: 우리가 제안한 유형별 명제 패러다임에 대해 생각하는 두 가지 방법은 근본적인 면에서 다릅니다.

source: The type @Nat.below C (3 : nat) is a data structure that stores elements of C 0, C 1, and C 2.
ko: @Nat.below C (3 : nat)형은 C 0, C 1과 C 2의 원소를 저장하는 데이터 구조입니다.

source: The type algebra β → γ and α → β means it is a requirement that the type of the output of the second function must match the type of the input to the first function - which makes sense, otherwise the two functions would not be composable.
ko: β → γ 와 α → β의 유형 대수는 두 번째 함수의 출력 유형이 첫 번째 함수의 입력 유형과 반드시 일치해야 한다는 요구를 같습니다. 이렇지 않다면 두 함수는 합성될 수 없을 것입니다.

source: The type of t1 is now ∀ {p q : Prop}, p → q → p.
ko: t1의 유형은 이제 ∀ {p q : Prop}, p → q → p입니다.

source: The types in a have tactic can be omitted, so you can write have hp := h.left and have hqr := h.right.
ko: have 전략에서 유형은 생략될 수 있습니다. 그래서 여러분은 have hp := h.left과 have hqr := h.right을 쓸 수 있습니다.

source: The typing rules forces us to write f a for the first argument, but this term is neither a variable nor a constructor application, and plays no role in the pattern-matching definition.
ko: 입력 규칙은 우리가 첫 인수에 대해 f a로 쓰도록 합니다. 그러나 이 항은 변수도 생성자 적용도 아닙니다. 그리고 패턴 매칭 정의에서 어떤 역할도 하지 않습니다.

# The unicode symbol × for the Cartesian product is entered as imes.
source: The unicode symbol × for the Cartesian product is entered as \times.
ko: 카테시안 곱을 나타내는 유니코드 기호 ×는 \times을 입력하여 씁니다.

source: The universal quantifier, ∀ x : α, p x is supposed to denote the assertion that "for every x : α, p x" holds.
ko: 전칭 한정기호 ∀ x : α, p x 은 "모든 x : α에 대해 p x"가 성립한다는 주장을 가리켜야 할 것입니다.

source: The use of course-of-values recursion is one of the techniques the equation compiler uses to justify to the Lean kernel that a function terminates.
ko: course-of-values 재귀의 사용은 방정식 컴파일러가 함수를 끝내는 린 커널을 정당화하는데 사용하는 한 기법입니다.

source: The use of underscores for wildcards is common in functional programming languages, and so Lean adopts that notation.
ko: 와일드카드에 대한 밑줄 문자의 사용은 함수형 프로그래밍 언어에서 흔합니다. 그래서 린은 이 표기를 채택합니다.

source: The variable C represents the motive of the recursive definition: for each element x : α, we would like to construct an element of C x.
ko: 변수 C는 재귀적 정의의 동기를 나타냅니다. 각 원소 x : α에 대하여 우리는 C x의 원소를 생성하고자 합니다.

source: Then (x : α) → β is an element of Sort (imax i j), where imax i j is the maximum of i and j if j is not 0, and 0 otherwise.
ko: 그러면 (x : α) → β은 Sort (imax i j)의 원소입니다. 여기서 imax i j는 i와 j사이의 최대값이고, j가 0이 아니고, 이외에는 0입니다.

source: Then th3 combines the two results.
ko: 그런 뒤 th3는 이 두 결과를 결합합니다.

source: Then for n : Nat and m : Nat, the term Add.add n m triggers typeclass resolution with the goal of Add Nat, and typeclass resolution will synthesize the instance above.
ko: 그런 다음 n : Nat 및 m : Nat에 대해 항 Add.add n m는 Add Nat의 목표를 유형 클래스 해결책으로 만듭니다. 그리고 유형 클래스 해결책은 위의 개체를 합성합니다.

source: Then for any list xs, reverse (mk_symm xs) is equal to mk_symm xs, which can easily be proved by unfolding the definition:
ko: 그럼 임의의 리스트 xs에 대해 reverse (mk_symm xs)은 mk_symm xs과 같습니다. 그리고 이는 정의를 펼쳐보는 것으로 쉽게 증명할 수 있습니다.

source: Then go back and replace each sorry with an actual proof, until no more remain.
ko: 그리고 다시 뒤로 돌아가 각각의 sorry가 더 남지 않을 때까지 실제 증명으로 바꾸세요.

source: Then next applies commutativity to the term b + c; without specifying the argument, the tactic would instead rewrite a + (b + c) to (b + c) + a.
ko: 그 뒤 항 b + c에 교환성을 적용합니다 . 인수의 명시 없이 전략은 a + (b + c)에서 (b + c) + a으로 다시 쓸 겁니다.

source: Then the new hypothesis a = 0 is used to rewrite the goal to f 0 = f 0.
ko: 그 뒤 새로운 가정 a = 0 가 목표를 f 0 = f 0으로 다시 쓰도록 사용됩니다.

source: Then the universe level u is constrained to satisfy the following:
ko: 그러면 세계 수준 u는 다음을 만족하도록 제한됩니다.

source: Then try proving some of their basic properties, building on the theorems we have already proved.
ko: 그 뒤 그들의 기본 성질 몇 가지를 증명해보세요. 우리가 이미 증명한 정리를 세워보세요.

source: Then use e.g. mdbook watch in the root folder:
ko: 루트 폴더에서 mdbook watch을 사용합니다.

source: Then use the equation compiler to derive some of their basic properties.
ko: 그 뒤 방정식 컴파일러를 그들의 기본 성질 몇 가지를 유도하는데 사용하세요.

source: Then we can "cancel" the hypothesis and obtain a proof of Implies p q.
ko: 그러면 우리는 가정을 "상쇄"하여 Implies p q의 증명을 얻을 수 있습니다.

source: Then, the second one replaces f 0 with 0.
ko: 그런 뒤 두 번째 것은 f 0을 0으로 대체합니다.

source: Then, we use the command macro_rules to specify what should be done when triv is used.
ko: 그러면 우리는 triv가 사용될 때 macro_rules 명령이 무엇을 해야 하는지 명시하도록 사용할 수 있다.

source: Then, when we write the expression f 7 without further arguments, it is parsed as f 7 _.
ko: 그럼, 우리가 표현식 f 7을 추가 인수없이 슬때, 이는 f 7 _와 같이 구문 분석 될 것입니다.

source: Then, you can construct lists of Nat as follows.
ko: 그럼 여러분은 Nat의 리스트를 다음과 같이 생성할 수 있습니다.

source: There are a few more things to notice here.
ko: 여기서 몇 개 더 짚고가야 할 것이 있습니다.

source: There are a few pragmatic differences between definitions and theorems, however.
ko: 하지만 정의와 정리 사이에 약간의 실용적 차이는 있습니다.

source: There are a number of ways in which you can query Lean for information about its current state and the objects and theorems that are available in the current context.
ko: 여러분이 린에게 그것의 현재 상태와 현재 상황에서 사용할 수 있는 대상과 정리에 대한 정보를 요청하는 여러가지 방법이 있습니다.

source: There are at least two ways of thinking about propositions as types.
ko: 유형으로써 명제에 대해 생각할 수 있는 최소한 두 가지 방법이 있습니다.

source: There are currently two ways to use Lean.
ko: 현재 Lean을 사용하는 두 가지 방식이 있습니다.

source: There are extra bells and whistles.
ko: 여기 여분의 종과 호루라기가 있습니다.

source: There are rules that govern what the eliminator of an inductive type can eliminate to, that is, what kinds of types can be the target of a recursor.
ko: 귀납형의 제거자가 제거할 수 있는 것, 즉 유형의 어느 종류가 재귀자의 대상이 될 수 있는가를 다루는 규칙이 있습니다.

source: There are several ways to fix this issue, and one way is to use a more precise tool : the conversion mode.
ko: 이 문제를 해결하는 방법에는 여러 가지가 있으며 한 가지 방법은 보다 정밀한 도구인 전환 모드를 사용하는 것입니다.

source: There are two additional modifiers that are useful.
ko: 이외 유용한 두 수정자들이 더 있습니다.

source: There are two constructors.
ko: 두 생성자가 있습니다.

source: There is a fine line between brevity and obfuscation, and omitting information in this way can sometimes make a proof harder to read.
ko: 간결함과 가독성 사이에 미세찬 차이가 있고 이런 식으로 정보를 생략하는 것은 때때로 증명을 읽기 더 어렵게 만들 수 있습니다.

source: There is a long cast of characters here, but the first block we have already seen: the type, α, the relation, r, and the assumption, h, that r is well founded.
ko: 여기 문자의 긴 캐스트가 있지만 우리는 이미 유형 α, 관계 r 그리고 가정 h으로 된 첫 블럭을 봤습니다. 여기서 r은 잘 세워진 것입니다.

source: There is a small exception to this rule, however, which we will discuss below, in the section on inductive families.
ko: 그러나 이 규칙에 우리가 아래에서 논의할 작은 예외가 귀납군의 섹션에 있습니다.

source: There is a third kind of implicit argument that is denoted with square brackets, [ and ].
ko: 대괄호 [과 ]로 표시된 세 번째 종류의 암시적인 매개변수가 있습니다.

source: There is also a have tactic, which introduces a new subgoal, just as when writing proof terms:
ko: 증명항을 작성할 때처럼 have 전략은 새로운 하위목표를 도입합니다.

source: There is an exception to this last rule: we are allowed to eliminate from an inductively defined Prop to an arbitrary Sort when there is only one constructor and each constructor argument is either in Prop or an index.
ko: 이 마지막 규칙에 예외가 있습니다. 우리는 재귀적으로 정의된 Prop에서 임의의 Sort이르기까지 오직 한 생성자와 각 생성자 인수가 Prop에 있거나 한 색인으로 있을 때 제거할 수 있습니다.

source: There is only one anonymous namespace at the root level.
ko: root 계층에서만 익명 이름 공간이 있습니다.

source: Thereafter decidable p has an instance for every p.
ko: 그 후에 decidable p는 모든 p에 대해 개체를 갖습니다.

source: These annotations are essential, for example, when a term occurring in the left-hand side is neither a variable nor a constructor application, because these are not suitable targets for pattern matching.
ko: 이 주석은 필수적입니다. 예를 들어 좌변에서 나타나는 항이 변수도 생성자 적용도 아닐 때, 이들은 패턴 매칭에 적적한 대상이 아니기 때문입니다.
